results/exp1/20260224T024240Z-vanilla-katran/raw/wrk/c64/run-1.txt
Running 1m test @ http://192.168.100.100:8080/exp1-1k.txt
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   252.68us   53.06us   3.34ms   73.75%
    Req/Sec    62.60k     5.12k   87.26k    75.91%
  Latency Distribution
     50%  243.00us
     75%  276.00us
     90%  331.00us
     99%  389.00us
  14966361 requests in 1.00m, 17.74GB read
Requests/sec: 249025.82
Transfer/sec:    302.32MB